// Файл описания схемы выч-го уст-ва на БИС ВУ4 , ВС1 (8-разр). 
// Имя файла содержимого памяти для PZU - memory2.pzu(перемножение чисел -23 и -10) 
// Имя файла содержимого памяти для PZU - memory4.pzu(перемножение чисел -12 и -9) 

>ELEMENTS

 D1   GENERATOR  :0,10,6,5
 D2   GOI        :1,4,20
 D3   MUX
 D4   PZU        :64,64
 D5   K1804VU4
 D6   DC_REG     :64
 D7   AND
 D8   AND
 D9   AND
 D10  AND
 D11  LOW_HI
 D12  K1804VS1   :2

>WIRES

 V1 : D1.1, D5.10, D6.65, D12.14
// не R
 V2 : D2.1, D7.1, D8.1, D9.1, D10.1, D6.66
 V3 : D7.5, D5.14
 V4 : D8.5, D5.13
 V5 : D9.5, D5.12
 V6 : D10.5, D5.11
// РМК -> ВУ4(MI0-MI3) 
 V7 : D7.2, D6.67
 V8 : D8.2, D6.68
 V9 : D9.2, D6.69
 V10 : D10.2, D6.70
// МПП -> РМК
 V11-74 : D6.1-64
 V11-74 : D4.8-71
// ВУ4(Y0-Y5) -> МПП(A0-A5)
 V75 : D4.1, D5.27
 V76 : D4.2, D5.28
 V77 : D4.3, D5.29
 V78 : D4.4, D5.30
 V79 : D4.5, D5.31
 V80 : D4.6, D5.32
// "0" -> ВУ4(OE,CCE) 
 V81 : D11.1, D5.8, D5.3
// "1" -> ВУ4(CI)
 V114 : D11.2, D5.9 
// Описание связей идущих от RMK к ВУ4 и ВС1
// РМК -> ВУ4(DI0-DI11)
 V82 : D6.82, D5.15
 V83 : D6.81, D5.16
 V84 : D6.80, D5.17
 V85 : D6.79, D5.18
 V86 : D6.78, D5.19
 V87 : D6.77, D5.20
 V88 : D6.76, D5.21
 V89 : D6.75, D5.22
 V90 : D6.74, D5.23
 V91 : D6.73, D5.24
 V92 : D6.72, D5.25
 V93 : D6.71, D5.26
// РМК ->ВУ4(S1,S0,RLD)
 V94 : D6.83, D3.6
 V95 : D6.84, D3.5
 V96 : D6.85, D5.1
// РМК - БОД(MI0-MI8)
 V97 : D6.86, D12.7
 V98 : D6.87, D12.6
 V99 : D6.88, D12.5
 V100 : D6.89, D12.23
 V101 : D6.90, D12.22
 V102 : D6.91, D12.21
 V103 : D6.92, D12.13
 V104 : D6.93, D12.12
 V105 : D6.94, D12.11
// РМК - БОД(DI0-DI7)
 V106 : D6.95, D12.44
 V107 : D6.96, D12.43
 V108 : D6.97, D12.42
 V109 : D6.98, D12.41
 V110 : D6.99, D12.40
 V111 : D6.100, D12.39
 V112 : D6.101, D12.38
 V113 : D6.102, D12.37
// AA - БОД
 V122 : D6.103, D12.4
 V123 : D6.104, D12.3
 V124 : D6.105, D12.2
 V125 : D6.106, D12.1
// AB - БОД
 V126 : D6.107, D12.19
 V127 : D6.108, D12.18
 V128 : D6.109, D12.17
 V129 : D6.110, D12.16
// C0 - БОД
 V130 : D6.111, D12.24
// Флаги(PF7,N,C7) -> MUX
 V132 : D12.8, D3.1
 V134 : D12.10, D3.2
 V135 : D12.26, D3.3
// MUX -> ВУ4(CC)
 V133 : D3.7, D5.2
// "0"-> OE(БОД)
 V136 : D11.1, D12.28, D12.9
