# ifndef __LEVCONV_HPP
# define __LEVCONV_HPP 1

# include "..\..\main\const.hpp"

extern void __fastcall LevelToString(char Level,char *string);

//---------------------------------------------------------------
//  ѕреобразует двоичное число , заданное в виде символьной
//  строки ,в число типа unsigned long . ѕри этом подразумеваетс€
//  Str[0] - старший разр€д.
//---------------------------------------------------------------
extern dword __fastcall StrToUnLong(char *Str,int Place,int Len);

//---------------------------------------------------------------
//  ѕреобразует число типа unsigned long , в двоичную строку где
//  один бит представл€етс€ байтом.
//  ѕри этом подразумеваетс€  Str[0] - старший разр€д.
//---------------------------------------------------------------
extern void __fastcall UnLongToBin(dword Value,char *Str,int BitCount);

//---------------------------------------------------------------
//  ћен€ет пор€док символов в строке на обратный
//---------------------------------------------------------------
extern void __fastcall StrRev(char *Str,int Len);

//---------------------------------------------------------------
//  ѕровер€ет наличие в строке символов неопределенного уровн€
//---------------------------------------------------------------
extern bool __fastcall CheckUndefLevel(byte *Str,int Len);

//---------------------------------------------------------------
//  ѕреобразует уровни определенные константами HI_LEVEL и LOW_LEVEL
//  в числа 1 и 0 соответственно. ƒанна€ операци€ необходима в некоторых
//  процедурах дл€ обеспечени€ их корректной работы.
//---------------------------------------------------------------
byte _fastcall ConvertLevel(byte *Str);

//---------------------------------------------------------------
// ƒополнить строку заданным символов до size длины
//---------------------------------------------------------------
void __fastcall CompleteString(char *src,char symb,int size);

//---------------------------------------------------------------
//  ѕреобразует двоичную строку в текстовую строку двоичного вида 0->"0"
//---------------------------------------------------------------
void __fastcall BinNumToBinSymb(char *Str,int Len);

//---------------------------------------------------------------
//  ѕреобразует двоичную строку в текстовую шестнадцатеричную
//---------------------------------------------------------------
 void __fastcall BinToHex(char *BinString,int LenBin,char *HexString);

 # endif
