
# include "TLowHi.hpp"
# include <stdlib.h>
# include <vcl\dstring.h>
# include <alloc.h>

// // // // // // // // // // // // // // // // // // // // // // // //
//  Описание прототипов методов класса TConstant
// // // // // // // // // // // // // // // // // // // // // // // //

//=====================================================================
//  Метод Run . Осуществляет моделирование сигнала нижнего и высокого
//              уровня в дискретные моменты времени(кванты)
//---------------------------------------------------------------------
  void TConstant::Run(void)
    {
      *Low = LOW_LEVEL;
      *Hi = HI_LEVEL;
    }

//=====================================================================
//  Процедура инициализации
//---------------------------------------------------------------------
  int TConstant::Init(string80 Array[])
    {
      string80 *Buf;

      if ((Parameters = (byte *)malloc(2))==NULL)
    	{
    	  Error = MY_ERROR;
    	  return(MY_ERROR);
    	}

      Buf = Array;  //  используется для
      Buf = Buf;    //  уничтожения Warning-ов при компиляции

      Low = &Parameters[0];
      Hi = &Parameters[1];

      return(MY_NO_ERROR);
    }

//=====================================================================
//  Процедура инициализации моделей выводов элементов
//---------------------------------------------------------------------
  int TConstant::InitPin(void)
    {
      *Low = (byte)(LOW_LEVEL | (*Low & 0xF0));
      *Hi = (byte)(HI_LEVEL | (*Hi & 0xF0));
      return(MY_NO_ERROR);
    }

//=====================================================================
//  Процедура установки в начальное состояние
//---------------------------------------------------------------------
  void TConstant::Reset()
    {
      InitPin();
      Update();
      //
    }

//=====================================================================
//  Конструктор
//---------------------------------------------------------------------
  TConstant::TConstant(int Number,TComponent *Owner) : TModelItem(Number)
    {
      AnsiString temp(Number);
      
      ConstForm = new TConstForm(Owner);
      ModelForm = ConstForm;
      ConstForm->Caption = "Константа D" + temp;
      Low = NULL;
      Hi = NULL;
    }

//=====================================================================
//  Деструктор
//---------------------------------------------------------------------
  TConstant::~TConstant()
    {
      if (ConstForm != NULL)
        {
	      delete ConstForm;
	    }
    }

// // // // // // // // // // // // // // // // // // // // // // // //
//  Конец описания прототипов методов класса TConstant
// // // // // // // // // // // // // // // // // // // // // // // //

